avikde/koduino/stm32/boards.txt

menu.hse=HSE
menu.bootloader=Bootloader

f37x.name=f37x
f37x.build.mcu=STM32F37x
f37x.build.series=STM32F37x
f37x.build.f_cpu=72000000L
# f37x.build.usb_product="M4"
# f37x.build.board=f37x
f37x.build.core=arduino
f37x.build.extra_flags=
f37x.build.ldscript=STM32_FLASH.ld
f37x.build.variant=f37x

# HSE choices
f37x.build.hse_value=16000000UL
f37x.build.hse_clock=0

# f37x.menu.hse.8mhz=8MHz clock
# f37x.menu.hse.8mhz.build.hse_value=8000000UL
# f37x.menu.hse.8mhz.build.hse_clock=1

# f37x.menu.hse.16mhz=16MHz
# f37x.menu.hse.16mhz.build.hse_value=16000000UL
# f37x.menu.hse.16mhz.build.hse_clock=0

# f37x.menu.hse.24mhz=24MHz clock
# f37x.menu.hse.24mhz.build.hse_value=24000000UL
# f37x.menu.hse.24mhz.build.hse_clock=1

# Upload choices
f37x.upload.tool=stm32ld
f37x.upload.protocol=serial
# f37x.upload.sequence=-rts,-dtr,dtr:rts,-dtr,dtr
f37x.upload.baud=230400
f37x.upload.maximum_size=262144
# f37x.menu.bootloader.serial=Serial
# f37x.menu.bootloader.serial.upload.tool=stm32loader
# f37x.menu.bootloader.serial.upload.protocol=serial

# f37x.menu.bootloader.dfu_util=DFU
# f37x.menu.bootloader.dfu_util.upload.tool=dfu_util
# f37x.menu.bootloader.dfu_util.upload.protocol=dfu

# f37x.build.vid=0x2341
# f37x.build.pid=0x003e

